#include <stdio.h>

/*В двоичном файле поменять местами две записи с заданными номерами. Обязательно проверить, что записи с такими номерами существуют в файле. Следует читать не весь файл, а только нужные записи – в двоичном файле возможен прямой доступ (никаких циклов!). При выполнении этого задания необходимо преобразовать текстовый файл в двоичный, а также вывести на экран содержимое двоичного файла до обработки и после обработки. Не забывайте закрывать файлы.*/

int main(int argc, argv[]) {

    return 0;
}
